let data=[{
    slok:"धृतराष्ट्र उवाचधर्मक्षेत्रे कुरुक्षेत्रे समवेता युयुत्सवः। मामकाः पाण्डवाश्चैव किमकुर्वत सञ्जय",
    translation:"धृतराष्ट्र बोले (टिप्पणी प0 1.2) - हे संजय! (टिप्पणी प0 1.3) धर्मभूमि कुरुक्षेत्र में युद्ध की इच्छा से इकट्ठे हुए मेरेे और पाण्डु के पुत्रों ने भी क्या किया"
},
{
    slok:`सञ्जय उवाच,

    दृष्ट्वा तु पाण्डवानीकं व्यूढं दुर्योधनस्तदा।
    
    आचार्यमुपसङ्गम्य राजा वचनमब्रवीत्`,
    translation:`संजय बोले - उस समय वज्रव्यूह-से खड़ी हुई पाण्डव-सेना को देखकर राजा दुर्योधन द्रोणाचार्य के पास जाकर यह वचन बोला`
},

{
    slok:`पश्यैतां पाण्डुपुत्राणामाचार्य महतीं चमूम्।

    व्यूढां द्रुपदपुत्रेण तव शिष्येण धीमता।।1.3।।`,

    translation:`हे आचार्य! आपके बुद्धिमान् शिष्य द्रुपदपुत्र धृष्टद्युम्न के द्वारा व्यूहरचना से खड़ी की हुई पाण्डवों की इस बड़ी भारी सेना को देखिये`
}
,
{
    slok:`अत्र शूरा महेष्वासा भीमार्जुनसमा युधि।

    युयुधानो विराटश्च द्रुपदश्च महारथः।।1.4।।`,

    translation:`यहाँ (पाण्डवों की सेना में) बड़े-बड़े शूरवीर हैं, जिनके बहुत बड़े-बड़े धनुष हैं तथा जो युद्ध में भीम और अर्जुनके समान हैं। उनमें युयुधान (सात्यकि), राजा विराट और महारथी द्रुपद भी हैं। धृष्टकेतु और चेकितान तथा पराक्रमी काशिराज भी हैं। पुरुजित् और कुन्तिभोज--ये दोनों भाई तथा मनुष्योंमें श्रेष्ठ शैब्य भी हैं। पराक्रमी युधामन्यु और पराक्रमी उत्तमौजा भी हैं। सुभद्रापुत्र अभिमन्यु और द्रौपदी के पाँचों पुत्र भी हैं। ये सब-के-सब महारथी हैं।`

},

{
    slok:`धृष्टकेतुश्चेकितानः काशिराजश्च वीर्यवान्।

    पुरुजित्कुन्तिभोजश्च शैब्यश्च नरपुङ्गवः।।1.5।।`,

    translation:`यहाँ (पाण्डवों की सेना में) बड़े-बड़े शूरवीर हैं, जिनके बहुत बड़े-बड़े धनुष हैं तथा जो युद्ध में भीम और अर्जुनके समान हैं। उनमें युयुधान (सात्यकि), राजा विराट और महारथी द्रुपद भी हैं। धृष्टकेतु और चेकितान तथा पराक्रमी काशिराज भी हैं। पुरुजित् और कुन्तिभोज--ये दोनों भाई तथा मनुष्योंमें श्रेष्ठ शैब्य भी हैं। पराक्रमी युधामन्यु और पराक्रमी उत्तमौजा भी हैं। सुभद्रापुत्र अभिमन्यु और द्रौपदी के पाँचों पुत्र भी हैं। ये सब-के-सब महारथी हैं।`
},

{
    slok:`युधामन्युश्च विक्रान्त उत्तमौजाश्च वीर्यवान्।

    सौभद्रो द्रौपदेयाश्च सर्व एव महारथाः।।1.6।।`,

    translation:`।1.4 -- 1.6।। यहाँ (पाण्डवों की सेना में) बड़े-बड़े शूरवीर हैं, जिनके बहुत बड़े-बड़े धनुष हैं तथा जो युद्ध में भीम और अर्जुनके समान हैं। उनमें युयुधान (सात्यकि), राजा विराट और महारथी द्रुपद भी हैं। धृष्टकेतु और चेकितान तथा पराक्रमी काशिराज भी हैं। पुरुजित् और कुन्तिभोज--ये दोनों भाई तथा मनुष्योंमें श्रेष्ठ शैब्य भी हैं। पराक्रमी युधामन्यु और पराक्रमी उत्तमौजा भी हैं। सुभद्रापुत्र अभिमन्यु और द्रौपदी के पाँचों पुत्र भी हैं। ये सब-के-सब महारथी हैं।`
},

{
    slok:`अस्माकं तु विशिष्टा ये तान्निबोध द्विजोत्तम।

    नायका मम सैन्यस्य संज्ञार्थं तान्ब्रवीमि ते।।1.7।।`,

    translation:`।1.7।। हे द्विजोत्तम! हमारे पक्ष में भी जो मुख्य हैं, उनपर भी आप ध्यान दीजिये। आपको याद दिलाने के लिये मेरी सेना के जो नायक हैं, उनको मैं कहता हूँ।
    `
}

]



let previous = document.getElementById("previous");
 let next = document.getElementById("next");
 let slok = document.getElementById("slok");
let translation = document.getElementById("translation");
// let slono=document.getElementById("slokno");
let x=0;



function firstslok(x){
    slok.innerHTML=data[x].slok;
    translation.innerHTML=data[x].translation;
    


 }
 firstslok(x)

 function Nextslok(x)
 {
    slok.innerHTML=data[x].slok;
    translation.innerHTML=data[x].translation;
    
    
 }

 function Slok(x){

     slok.innerHTML=data[x].slok;
     translation.innerHTML=data[x].translation;
    
}


 next.addEventListener("click",()=>{
     if( x>=0 && x<data.length-1)
     {
         x=x+1
       
        Slok(x);
        
  
    }
});


previous.addEventListener("click",()=>{
     if(x>=1)
     {
         x=x-1;
        
       Slok(x);
        
    }

 })